//*************************************************
//ヘッダインクルード
//*************************************************
#include "menu.h"
#include "player.h"
#include "input.h"
#include "sprite.h"
#include "Texture.h"
#include "mydirect3d.h"

//*************************************************
//マクロ定義
//*************************************************

//*************************************************
//列挙型
//*************************************************

//*************************************************
//構造体宣言
//*************************************************

//*************************************************
//グローバル変数
//*************************************************
static PLAYER* pPlayer;
static LPDIRECT3DDEVICE9 pDevice;

//*************************************************
//メニューを開いている間、main文の役割を果たす
//*************************************************
void Menu_Loop(void)
{
	Menu_Init();

	while (1)
	{
		Keyboard_Update();
		Menu_Update();
		Menu_Draw();

		if (pPlayer->OpenMenu == false)
		{
			break;
		}
	}
}
                
//*************************************************
//初期化
//*************************************************
void Menu_Init(void)
{
	pPlayer = Player_GetPlayer();
	pDevice = MyDirect3D_GetDevice();
}

//*************************************************
//更新
//*************************************************
void Menu_Update(void)
{
	if (Keyboard_IsPress(DIK_E))
	{
		pPlayer->OpenMenu = false;
	}
}

//*************************************************
//描画
//*************************************************
void Menu_Draw(void)
{
	pDevice->Clear(0, NULL, D3DCLEAR_TARGET | D3DCLEAR_ZBUFFER, D3DCOLOR_RGBA(100, 80, 200, 255), 1.0f, 0);   //画面のクリア(注：黒と白色は避ける)・第五引数は深さの設定で0.0f(最も手前)にしない
	pDevice->BeginScene();                                                                                    //バッチ処理開始
	 /*ここに描画情報を書く*/

	Sprite_SetColor(D3DCOLOR_RGBA(255, 255, 255, 255));
	Sprite_Draw(TEXTURE_INDEX_GAME_CLEAR, 0, 0);

	/*ここまで*/
	pDevice->EndScene();                                                                                      //バッチ処理終了
	pDevice->Present(NULL, NULL, NULL, NULL);
}